"""
손님에게 출생년도를 4자리로 입력받아서 이 손님이 `성인`인지 판정하여
`True` 또는 `False`로 출력하는 프로그램을 구현하세요
(단, 한국에서 성인은 만나이가 아닌 한국 나이로 20세 이상을 의미합니다)

단계
1. 출생년도 입력
2. 한국 나이 계산 (내가 살아온 연도 개수 → A부터 B까지 범위의 숫자 개수 → B - A + 1)
3. 성인 판정
4. 결과 출력

2026년생 => 2026 - 2026 + 1 => 1살
2025년생 => 2026 - 2025 + 1 => 2살
2024년생 => 2026 - 2024 + 1 => 3살
2023년생 => 2026 - 2023 + 1 => 4살
...
N년생 => 2026 - N + 1
"""

# 입력1
birth = int(input("출생년도(4자리) : "))

# 연산1(출력1)
age = 2026 - birth + 1
# print(age)

# 연산2
adult = age >= 20

# 출력2
print(adult)