"""
# 실습 문제 : 윤년 판정하기

파일명 : `03_condition/04_복잡한논리실습2.py`

윤년이란 1년이 365일이 아니라 366일로 계산되는 해를 말합니다.
윤년은 현실과 달력의 차이를 없에기 위해 다음과 같은 규칙으로 계산됩니다.

- 4의 배수는 윤년입니다.
- 100의 배수는 윤년이 아닙니다. (4의 배수여도 상관없습니다)
- 400의 배수는 윤년입니다. (4, 100의 배수여부와 관계없습니다)
"""

# 입력
year = int(input("연도 4자리 입력 :"))

# 연산

# leap = 4의배수이면서 100의배수는 아니고 400의 배수면 ok    ---> 의사코드
# leap = 4의배수 and 100의배수아님 or 400의배수

is4 = year % 4 == 0
not100 = year % 100 != 0
is400 = year % 400 == 0
# print(is4, not100, is400)

leap = is4 and not100 or is400

# 출력
print("윤년인가?", leap)