"""
시작하면 컴퓨터가 1 ~ 1000 사이의 랜덤한 정수를 하나 추첨하여 이를 정답으로 설정합니다.
총 10번의 기회를 주고 사용자가 숫자를 입력해서 이것을 맞추는 게임을 구현하세요

사용자가 입력한 숫자보다 정답이 더 크다면 화면에 업이라고 출력합니다.
사용자가 입력한 숫자보다 정답이 더 작다면 화면에 다운이라고 출력합니다.
사용자가 입력한 숫자가 정답이라면 정답을 외치고 반복을 종료합니다.
반복이 끝나면 프로그합니다램을 종료.라는 메세지를 출력하도록 구현합니다.

다음은 실행 예시 화면입니다.
()로 표시된 곳은 사용자가 입력했다는 뜻입니다.
컴퓨터가 무작위로 정답을 생성했습니다.
정답 입력 : (500)
업(UP)!
정답 입력 : (750)
다운(DOWN)!
정답 입력 : (700)
업(UP)!
정답 입력 : (720)
업(UP)!
정답 입력 : (723)
다운(DOWN)!
정답 입력 : (721)
정답!
프로그램을 종료합니다.


HINT

반복을 횟수와 상관없이 중간에 그만두게 할 때는 break라는 키워드를 사용합니다.
원하는 상황을 조건으로 설정한 뒤 break 키워드를 내부에 적어두면 해당 시점에 반복을 탈출하게 됩니다.

추가로 고민해볼 내용들
마지막 프로그램이 종료될 때 정답을 맞추고 끝났는지, 정답을 못 맞추고 끝났는지 알아내려면 무엇을 추가해야 할까요?

"""
import random

up=0
down=0

for i in range(10):








